; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob43) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 crate13 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate0)
	(at pallet1 depot1)
	(clear crate10)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear crate1)
	(at pallet4 distributor1)
	(clear pallet4)
	(at pallet5 distributor2)
	(clear crate7)
	(at pallet6 distributor0)
	(clear pallet6)
	(at pallet7 distributor0)
	(clear crate9)
	(at pallet8 distributor1)
	(clear pallet8)
	(at pallet9 distributor0)
	(clear crate13)
	(at truck0 depot2)
	(at truck1 distributor2)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 depot1)
	(available hoist6)
	(at crate0 depot0)
	(on crate0 pallet0)
	(at crate1 distributor0)
	(on crate1 pallet3)
	(at crate2 depot1)
	(on crate2 pallet1)
	(at crate3 distributor0)
	(on crate3 pallet9)
	(at crate4 depot1)
	(on crate4 crate2)
	(at crate5 distributor2)
	(on crate5 pallet5)
	(at crate6 depot1)
	(on crate6 crate4)
	(at crate7 distributor2)
	(on crate7 crate5)
	(at crate8 distributor0)
	(on crate8 pallet7)
	(at crate9 distributor0)
	(on crate9 crate8)
	(at crate10 depot1)
	(on crate10 crate6)
	(at crate11 distributor0)
	(on crate11 crate3)
	(at crate12 distributor0)
	(on crate12 crate11)
	(at crate13 distributor0)
	(on crate13 crate12)
)

(:goal (and
		(on crate0 crate12)
		(on crate1 crate6)
		(on crate3 crate0)
		(on crate4 crate8)
		(on crate5 pallet3)
		(on crate6 pallet4)
		(on crate7 pallet0)
		(on crate8 pallet7)
		(on crate9 pallet5)
		(on crate10 crate9)
		(on crate11 pallet9)
		(on crate12 pallet1)
		(on crate13 pallet2)
	)
))

; plan
1. (drive truck1 distributor2 depot1)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot1)
   goals met: 1 of 13
2. (lift hoist6 crate10 crate6 depot1)
   deleted: (at crate10 depot1) (clear crate10) (available hoist6) (on crate10 crate6)
   added: (lifting hoist6 crate10) (clear crate6)
   goals met: 1 of 13
3. (load hoist6 crate10 truck1 depot1)
   deleted: (lifting hoist6 crate10)
   added: (in crate10 truck1) (available hoist6)
   goals met: 1 of 13
4. (drive truck1 depot1 distributor0)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor0)
   goals met: 1 of 13
5. (lift hoist1 crate6 crate4 depot1)
   deleted: (at crate6 depot1) (clear crate6) (available hoist1) (on crate6 crate4)
   added: (lifting hoist1 crate6) (clear crate4)
   goals met: 1 of 13
6. (drive truck0 depot2 depot1)
   deleted: (at truck0 depot2)
   added: (at truck0 depot1)
   goals met: 1 of 13
7. (load hoist1 crate6 truck0 depot1)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck0) (available hoist1)
   goals met: 1 of 13
8. (lift hoist6 crate4 crate2 depot1)
   deleted: (at crate4 depot1) (clear crate4) (available hoist6) (on crate4 crate2)
   added: (lifting hoist6 crate4) (clear crate2)
   goals met: 1 of 13
9. (load hoist6 crate4 truck0 depot1)
   deleted: (lifting hoist6 crate4)
   added: (in crate4 truck0) (available hoist6)
   goals met: 1 of 13
10. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   goals met: 1 of 13
11. (lift hoist5 crate7 crate5 distributor2)
   deleted: (at crate7 distributor2) (clear crate7) (available hoist5) (on crate7 crate5)
   added: (lifting hoist5 crate7) (clear crate5)
   goals met: 1 of 13
12. (drive truck1 distributor0 distributor2)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor2)
   goals met: 1 of 13
13. (load hoist5 crate7 truck1 distributor2)
   deleted: (lifting hoist5 crate7)
   added: (in crate7 truck1) (available hoist5)
   goals met: 1 of 13
14. (drive truck1 distributor2 depot0)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot0)
   goals met: 1 of 13
15. (lift hoist5 crate5 pallet5 distributor2)
   deleted: (at crate5 distributor2) (clear crate5) (available hoist5) (on crate5 pallet5)
   added: (lifting hoist5 crate5) (clear pallet5)
   goals met: 1 of 13
16. (drive truck1 depot0 distributor2)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor2)
   goals met: 1 of 13
17. (load hoist5 crate5 truck1 distributor2)
   deleted: (lifting hoist5 crate5)
   added: (in crate5 truck1) (available hoist5)
   goals met: 1 of 13
18. (drive truck1 distributor2 depot0)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot0)
   goals met: 1 of 13
19. (lift hoist0 crate0 pallet0 depot0)
   deleted: (at crate0 depot0) (clear crate0) (available hoist0) (on crate0 pallet0)
   added: (lifting hoist0 crate0) (clear pallet0)
   goals met: 1 of 13
20. (load hoist0 crate0 truck1 depot0)
   deleted: (lifting hoist0 crate0)
   added: (in crate0 truck1) (available hoist0)
   goals met: 1 of 13
21. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 1 of 13
22. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   goals met: 1 of 13
23. (unload hoist4 crate6 truck0 distributor1)
   deleted: (in crate6 truck0) (available hoist4)
   added: (lifting hoist4 crate6)
   goals met: 1 of 13
24. (drop hoist4 crate6 pallet4 distributor1)
   deleted: (lifting hoist4 crate6) (clear pallet4)
   added: (available hoist4) (at crate6 distributor1) (clear crate6) (on crate6 pallet4)
   goals met: 2 of 13
25. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   goals met: 2 of 13
26. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 2 of 13
27. (unload hoist0 crate7 truck1 depot0)
   deleted: (in crate7 truck1) (available hoist0)
   added: (lifting hoist0 crate7)
   goals met: 2 of 13
28. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 2 of 13
29. (drop hoist0 crate7 pallet0 depot0)
   deleted: (lifting hoist0 crate7) (clear pallet0)
   added: (available hoist0) (at crate7 depot0) (clear crate7) (on crate7 pallet0)
   goals met: 3 of 13
30. (lift hoist3 crate13 crate12 distributor0)
   deleted: (at crate13 distributor0) (clear crate13) (available hoist3) (on crate13 crate12)
   added: (lifting hoist3 crate13) (clear crate12)
   goals met: 3 of 13
31. (load hoist3 crate13 truck0 distributor0)
   deleted: (lifting hoist3 crate13)
   added: (in crate13 truck0) (available hoist3)
   goals met: 3 of 13
32. (drive truck0 distributor0 depot2)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot2)
   goals met: 3 of 13
33. (unload hoist2 crate13 truck0 depot2)
   deleted: (in crate13 truck0) (available hoist2)
   added: (lifting hoist2 crate13)
   goals met: 3 of 13
34. (drive truck0 depot2 distributor0)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor0)
   goals met: 3 of 13
35. (drop hoist2 crate13 pallet2 depot2)
   deleted: (lifting hoist2 crate13) (clear pallet2)
   added: (available hoist2) (at crate13 depot2) (clear crate13) (on crate13 pallet2)
   goals met: 4 of 13
36. (lift hoist3 crate12 crate11 distributor0)
   deleted: (at crate12 distributor0) (clear crate12) (available hoist3) (on crate12 crate11)
   added: (lifting hoist3 crate12) (clear crate11)
   goals met: 4 of 13
37. (load hoist3 crate12 truck1 distributor0)
   deleted: (lifting hoist3 crate12)
   added: (in crate12 truck1) (available hoist3)
   goals met: 4 of 13
38. (drive truck1 distributor0 depot1)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot1)
   goals met: 4 of 13
39. (unload hoist6 crate0 truck1 depot1)
   deleted: (in crate0 truck1) (available hoist6)
   added: (lifting hoist6 crate0)
   goals met: 4 of 13
40. (unload hoist1 crate12 truck1 depot1)
   deleted: (in crate12 truck1) (available hoist1)
   added: (lifting hoist1 crate12)
   goals met: 4 of 13
41. (drop hoist1 crate12 crate2 depot1)
   deleted: (lifting hoist1 crate12) (clear crate2)
   added: (available hoist1) (at crate12 depot1) (clear crate12) (on crate12 crate2)
   goals met: 4 of 13
42. (drop hoist6 crate0 crate12 depot1)
   deleted: (lifting hoist6 crate0) (clear crate12)
   added: (available hoist6) (at crate0 depot1) (clear crate0) (on crate0 crate12)
   goals met: 5 of 13
43. (lift hoist1 crate0 crate12 depot1)
   deleted: (at crate0 depot1) (clear crate0) (available hoist1) (on crate0 crate12)
   added: (lifting hoist1 crate0) (clear crate12)
   goals met: 4 of 13
44. (lift hoist6 crate12 crate2 depot1)
   deleted: (at crate12 depot1) (clear crate12) (available hoist6) (on crate12 crate2)
   added: (lifting hoist6 crate12) (clear crate2)
   goals met: 4 of 13
45. (load hoist1 crate0 truck1 depot1)
   deleted: (lifting hoist1 crate0)
   added: (in crate0 truck1) (available hoist1)
   goals met: 4 of 13
46. (drive truck1 depot1 distributor0)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor0)
   goals met: 4 of 13
47. (lift hoist1 crate2 pallet1 depot1)
   deleted: (at crate2 depot1) (clear crate2) (available hoist1) (on crate2 pallet1)
   added: (lifting hoist1 crate2) (clear pallet1)
   goals met: 4 of 13
48. (drop hoist6 crate12 pallet1 depot1)
   deleted: (lifting hoist6 crate12) (clear pallet1)
   added: (available hoist6) (at crate12 depot1) (clear crate12) (on crate12 pallet1)
   goals met: 5 of 13
49. (drive truck1 distributor0 depot1)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot1)
   goals met: 5 of 13
50. (unload hoist6 crate0 truck1 depot1)
   deleted: (in crate0 truck1) (available hoist6)
   added: (lifting hoist6 crate0)
   goals met: 5 of 13
51. (drive truck1 depot1 distributor0)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor0)
   goals met: 5 of 13
52. (drop hoist6 crate0 crate12 depot1)
   deleted: (lifting hoist6 crate0) (clear crate12)
   added: (available hoist6) (at crate0 depot1) (clear crate0) (on crate0 crate12)
   goals met: 6 of 13
53. (lift hoist3 crate11 crate3 distributor0)
   deleted: (at crate11 distributor0) (clear crate11) (available hoist3) (on crate11 crate3)
   added: (lifting hoist3 crate11) (clear crate3)
   goals met: 6 of 13
54. (load hoist3 crate11 truck0 distributor0)
   deleted: (lifting hoist3 crate11)
   added: (in crate11 truck0) (available hoist3)
   goals met: 6 of 13
55. (lift hoist3 crate1 pallet3 distributor0)
   deleted: (at crate1 distributor0) (clear crate1) (available hoist3) (on crate1 pallet3)
   added: (lifting hoist3 crate1) (clear pallet3)
   goals met: 6 of 13
56. (load hoist3 crate1 truck1 distributor0)
   deleted: (lifting hoist3 crate1)
   added: (in crate1 truck1) (available hoist3)
   goals met: 6 of 13
57. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 6 of 13
58. (unload hoist4 crate1 truck1 distributor1)
   deleted: (in crate1 truck1) (available hoist4)
   added: (lifting hoist4 crate1)
   goals met: 6 of 13
59. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   goals met: 6 of 13
60. (drop hoist4 crate1 crate6 distributor1)
   deleted: (lifting hoist4 crate1) (clear crate6)
   added: (available hoist4) (at crate1 distributor1) (clear crate1) (on crate1 crate6)
   goals met: 7 of 13
61. (lift hoist3 crate3 pallet9 distributor0)
   deleted: (at crate3 distributor0) (clear crate3) (available hoist3) (on crate3 pallet9)
   added: (lifting hoist3 crate3) (clear pallet9)
   goals met: 7 of 13
62. (load hoist3 crate3 truck0 distributor0)
   deleted: (lifting hoist3 crate3)
   added: (in crate3 truck0) (available hoist3)
   goals met: 7 of 13
63. (drive truck0 distributor0 depot1)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot1)
   goals met: 7 of 13
64. (unload hoist6 crate3 truck0 depot1)
   deleted: (in crate3 truck0) (available hoist6)
   added: (lifting hoist6 crate3)
   goals met: 7 of 13
65. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   goals met: 7 of 13
66. (drop hoist6 crate3 crate0 depot1)
   deleted: (lifting hoist6 crate3) (clear crate0)
   added: (available hoist6) (at crate3 depot1) (clear crate3) (on crate3 crate0)
   goals met: 8 of 13
67. (unload hoist3 crate5 truck1 distributor0)
   deleted: (in crate5 truck1) (available hoist3)
   added: (lifting hoist3 crate5)
   goals met: 8 of 13
68. (drop hoist3 crate5 pallet3 distributor0)
   deleted: (lifting hoist3 crate5) (clear pallet3)
   added: (available hoist3) (at crate5 distributor0) (clear crate5) (on crate5 pallet3)
   goals met: 9 of 13
69. (unload hoist3 crate11 truck0 distributor0)
   deleted: (in crate11 truck0) (available hoist3)
   added: (lifting hoist3 crate11)
   goals met: 9 of 13
70. (drop hoist3 crate11 pallet9 distributor0)
   deleted: (lifting hoist3 crate11) (clear pallet9)
   added: (available hoist3) (at crate11 distributor0) (clear crate11) (on crate11 pallet9)
   goals met: 10 of 13
71. (lift hoist3 crate9 crate8 distributor0)
   deleted: (at crate9 distributor0) (clear crate9) (available hoist3) (on crate9 crate8)
   added: (lifting hoist3 crate9) (clear crate8)
   goals met: 10 of 13
72. (load hoist3 crate9 truck1 distributor0)
   deleted: (lifting hoist3 crate9)
   added: (in crate9 truck1) (available hoist3)
   goals met: 10 of 13
73. (drive truck1 distributor0 distributor2)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor2)
   goals met: 10 of 13
74. (unload hoist5 crate9 truck1 distributor2)
   deleted: (in crate9 truck1) (available hoist5)
   added: (lifting hoist5 crate9)
   goals met: 10 of 13
75. (unload hoist3 crate4 truck0 distributor0)
   deleted: (in crate4 truck0) (available hoist3)
   added: (lifting hoist3 crate4)
   goals met: 10 of 13
76. (drop hoist5 crate9 pallet5 distributor2)
   deleted: (lifting hoist5 crate9) (clear pallet5)
   added: (available hoist5) (at crate9 distributor2) (clear crate9) (on crate9 pallet5)
   goals met: 11 of 13
77. (unload hoist5 crate10 truck1 distributor2)
   deleted: (in crate10 truck1) (available hoist5)
   added: (lifting hoist5 crate10)
   goals met: 11 of 13
78. (drop hoist3 crate4 crate8 distributor0)
   deleted: (lifting hoist3 crate4) (clear crate8)
   added: (available hoist3) (at crate4 distributor0) (clear crate4) (on crate4 crate8)
   goals met: 12 of 13
79. (drop hoist5 crate10 crate9 distributor2)
   deleted: (lifting hoist5 crate10) (clear crate9)
   added: (available hoist5) (at crate10 distributor2) (clear crate10) (on crate10 crate9)
   goals met: 13 of 13
